trunk/soccer_pool/app/controllers/users_controller.rb

  def create
    cookies.delete :auth_token
    # protects against session fixation attacks, wreaks havoc with
    # request forgery protection.
    # uncomment at your own risk
    # reset_session
    @user = User.new(params[:user])
    @user.save
---
INSERT INTO "users" ("salt", "updated_at", "crypted_password", "remember_token_expires_at", "remember_token", "login", "email", "created_at") VALUES('d2d1028542e26653e94b54ffc6960bb404f80286', '2009-11-27 02:42:24', '860f50318365ed94b7f905b3ccc2a57ee0c4c443', NULL, NULL, 'migue', 'migue@gmail.com', '2009-11-27 02:42:24')